#########################################################################
#  ORCA SDC constraints
#
#  Last modification: 2008-12-06 CC
#  - Changed the sdc_version to 1.7
#  
#  - Added 2 ns pre-CTS latency for SD_DDR_CLK
#  - Added comments
#  - Used wild card (*) for sd_mux_dq_out clock gating checks
#########################################################################

# set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_operating_conditions cb13fs120_tsmc_max -library cb13fs120_tsmc_max

create_clock -name pclk -period 15 -waveform { 0 7.5 } [get_ports {pclk}]
create_clock -name sys_clk -period 8 -waveform { 0 4 } [get_ports {sys_clk}]
create_clock -name sdr_clk -period 7.5 -waveform { 0 3.75 } [get_ports {sdr_clk}]

create_generated_clock -name PCI_CLK -source [get_ports {pclk}]  -multiply_by 1 \
    [get_pins {I_CLOCK_GEN/I_PLL_PCI/CLK}] 
create_generated_clock -name SDRAM_CLK -source [get_ports {sdr_clk}]  \
 -multiply_by 1 [get_pins {I_CLOCK_GEN/I_PLL_SD/CLK}] 
create_generated_clock -name SYS_2x_CLK -source [get_ports {sys_clk}]  \
 -multiply_by 2 [get_pins {I_CLOCK_GEN/I_CLKMUL/CLK_2X}] 
create_generated_clock -name SYS_CLK -source [get_ports {sys_clk}]  \
 -multiply_by 1 [get_pins {I_CLOCK_GEN/I_CLKMUL/CLK_1X}] 
create_generated_clock -name SD_DDR_CLK -source [get_pins {I_CLOCK_GEN/I_PLL_SD/CLK}]  -divide_by 1 [get_ports {sd_CK}] 

# Clock uncertainties. Used when design was synthesized
set_clock_uncertainty  0.3 -setup [get_clocks {PCI_CLK}]
set_clock_uncertainty  0.1 -setup [get_clocks {SDRAM_CLK}]
set_clock_uncertainty  0.2 -setup [get_clocks {SYS_CLK}]
set_clock_uncertainty  0.2 -setup [get_clocks {SYS_2x_CLK}]

# pre-CTS latency to compensate for mux and io-pad delay on SDRAM outgoing clock
set_clock_latency 2.0 [get_clocks SD_DDR_CLK]

set_case_analysis 0 [get_ports {scan_en}]
set_case_analysis 0 [get_ports {test_mode}]
set_case_analysis 0 [get_ports {power_save}]
set_case_analysis 0 [get_ports {pll_bypass}]
set_case_analysis 1 [get_ports {pm66en}]

set_false_path -from [get_clocks {SYS_CLK}] -to [get_clocks {PCI_CLK}]
set_false_path -from [get_clocks {SYS_2x_CLK}] -to [get_clocks {PCI_CLK}]
set_false_path -from [get_clocks {SDRAM_CLK}] -to [get_clocks {PCI_CLK}]
set_false_path -from [get_clocks {PCI_CLK}] -to [get_clocks {SDRAM_CLK}]
set_false_path -from [get_clocks {SYS_CLK}] -to [get_clocks {SDRAM_CLK}]
set_false_path -from [get_clocks {SYS_2x_CLK}] -to [get_clocks {SDRAM_CLK}]

set_false_path -from [get_clocks {PCI_CLK}] -to [get_clocks {SD_DDR_CLK}]
set_false_path -from [get_clocks {SYS_CLK}] -to [get_clocks {SD_DDR_CLK}]
set_false_path -from [get_clocks {SYS_2x_CLK}] -to [get_clocks {SD_DDR_CLK}]
set_false_path -from [get_clocks {PCI_CLK}] -to [get_clocks {SYS_CLK}]
set_false_path -from [get_clocks {SDRAM_CLK}] -to [get_clocks {SYS_CLK}]
set_false_path -from [get_clocks {PCI_CLK}] -to [get_clocks {SYS_2x_CLK}]
set_false_path -from [get_clocks {SDRAM_CLK}] -to [get_clocks {SYS_2x_CLK}]

set_input_delay 0.8 -max -clock "SDRAM_CLK" [get_ports {sd_DQ[*]}]
set_input_delay 0.2 -min -clock "SDRAM_CLK" [get_ports {sd_DQ[*]}]
set_input_delay 0.8 -add_delay -max -clock "SDRAM_CLK" -clock_fall [get_ports {sd_DQ[*]}]
set_input_delay 0.2 -add_delay -min -clock "SDRAM_CLK" -clock_fall [get_ports {sd_DQ[*]}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pm66en}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pm66en}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pserr_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pserr_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pperr_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pperr_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pstop_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pstop_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pdevsel_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pdevsel_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pirdy_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pirdy_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {ptrdy_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {ptrdy_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pframe_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pframe_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pc_be[*]}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pc_be[*]}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {ppar}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {ppar}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pad[*]}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pad[*]}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pgnt_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pgnt_n}]
set_input_delay 8 -max -clock "PCI_CLK" [get_ports {pidsel}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pidsel}]
set_input_delay 3 -max -clock "PCI_CLK" [get_ports {power_save}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {power_save}]
set_input_delay 3 -max -clock "PCI_CLK" [get_ports {test_mode}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {test_mode}]
set_input_delay 3 -max -clock "PCI_CLK" [get_ports {pll_bypass}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {pll_bypass}]
set_input_delay 3 -max -clock "PCI_CLK" [get_ports {scan_en}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {scan_en}]
set_input_delay 3 -max -clock "PCI_CLK" [get_ports {prst_n}]
set_input_delay 2 -min -clock "PCI_CLK" [get_ports {prst_n}]
set_output_delay 0.75 -max -clock "SD_DDR_CLK" [get_ports {sd_RW}]
set_output_delay -0.1 -min -clock "SD_DDR_CLK" [get_ports {sd_RW}]
set_output_delay 0.75 -max -clock "SD_DDR_CLK" [get_ports {sd_LD}]
set_output_delay -0.1 -min -clock "SD_DDR_CLK" [get_ports {sd_LD}]
set_output_delay 0.75 -max -clock "SD_DDR_CLK" [get_ports {sd_BWS[*]}]
set_output_delay -0.1 -min -clock "SD_DDR_CLK" [get_ports {sd_BWS[*]}]
set_output_delay 0.75 -max -clock "SD_DDR_CLK" [get_ports {sd_A[*]}]
set_output_delay -0.1 -min -clock "SD_DDR_CLK" [get_ports {sd_A[*]}]
set_output_delay 0.75 -max -clock "SD_DDR_CLK" [get_ports {sd_DQ[*]}]
set_output_delay -0.1 -min -clock "SD_DDR_CLK" [get_ports {sd_DQ[*]}]
set_output_delay 0.75 -add_delay -max -clock "SD_DDR_CLK" -clock_fall [get_ports {sd_DQ[*]}]
set_output_delay -0.1 -add_delay -min -clock "SD_DDR_CLK" -clock_fall [get_ports {sd_DQ[*]}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {preq_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {preq_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pserr_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pserr_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pperr_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pperr_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pstop_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pstop_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pdevsel_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pdevsel_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pirdy_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pirdy_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {ptrdy_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {ptrdy_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pframe_n}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pframe_n}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pc_be[*]}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pc_be[*]}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {ppar}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {ppar}]
set_output_delay 4 -max -clock "PCI_CLK" [get_ports {pad[*]}]
set_output_delay -1 -min -clock "PCI_CLK" [get_ports {pad[*]}]

set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_0_/CP}] -through [get_pins {sdram_DQ_iopad_0/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_1_/CP}] -through [get_pins {sdram_DQ_iopad_1/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_2_/CP}] -through [get_pins {sdram_DQ_iopad_2/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_3_/CP}] -through [get_pins {sdram_DQ_iopad_3/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_4_/CP}] -through [get_pins {sdram_DQ_iopad_4/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_5_/CP}] -through [get_pins {sdram_DQ_iopad_5/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_6_/CP}] -through [get_pins {sdram_DQ_iopad_6/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_7_/CP}] -through [get_pins {sdram_DQ_iopad_7/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_8_/CP}] -through [get_pins {sdram_DQ_iopad_8/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_9_/CP}] -through [get_pins {sdram_DQ_iopad_9/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_10_/CP}] -through [get_pins {sdram_DQ_iopad_10/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_11_/CP}] -through [get_pins {sdram_DQ_iopad_11/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_12_/CP}] -through [get_pins {sdram_DQ_iopad_12/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_13_/CP}] -through [get_pins {sdram_DQ_iopad_13/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_14_/CP}] -through [get_pins {sdram_DQ_iopad_14/OEN}]
set_false_path -from [get_pins {I_ORCA_TOP/I_SDRAM_TOP/I_SDRAM_IF/sd_DQ_en_reg_15_/CP}] -through [get_pins {sdram_DQ_iopad_15/OEN}]

set_input_transition -max 0.5 [get_ports {scan_en}]
set_load -pin_load 10 [get_ports {scan_en}]
set_input_transition -max 0.5 [get_ports {test_mode}]
set_load -pin_load 10 [get_ports {test_mode}]
set_input_transition -max 0.5 [get_ports {power_save}]
set_load -pin_load 10 [get_ports {power_save}]
set_input_transition -max 0.5 [get_ports {sys_clk}]
set_input_transition -max 0.5 [get_ports {pclk}]
set_input_transition -max 0.5 [get_ports {prst_n}]
set_input_transition -max 1 [get_ports {pidsel}]
set_load -pin_load 15 [get_ports {pidsel}]
set_input_transition -max 1 [get_ports {pgnt_n}]
set_load -pin_load 15 [get_ports {pgnt_n}]
set_input_transition -max 1 [get_ports {pad[*]}]
set_load -pin_load 15 [get_ports {pad[*]}]
set_input_transition -max 1 [get_ports {ppar}]
set_load -pin_load 15 [get_ports {ppar}]
set_input_transition -max 1 [get_ports {pc_be[*]}]
set_load -pin_load 15 [get_ports {pc_be[*]}]
set_input_transition -max 1 [get_ports {pframe_n}]
set_load -pin_load 15 [get_ports {pframe_n}]
set_input_transition -max 1 [get_ports {ptrdy_n}]
set_load -pin_load 15 [get_ports {ptrdy_n}]
set_input_transition -max 1 [get_ports {pirdy_n}]
set_load -pin_load 15 [get_ports {pirdy_n}]
set_input_transition -max 1 [get_ports {pdevsel_n}]
set_load -pin_load 15 [get_ports {pdevsel_n}]
set_input_transition -max 1 [get_ports {pstop_n}]
set_load -pin_load 15 [get_ports {pstop_n}]
set_input_transition -max 1 [get_ports {pperr_n}]
set_load -pin_load 15 [get_ports {pperr_n}]
set_input_transition -max 1 [get_ports {pserr_n}]
set_load -pin_load 15 [get_ports {pserr_n}]
set_load -pin_load 15 [get_ports {preq_n}]
set_input_transition -max 1 [get_ports {pm66en}]
set_load -pin_load 15 [get_ports {pm66en}]
set_input_transition -max 0.5 [get_ports {sdr_clk}]
set_load -pin_load 5 [get_ports {sd_CK}]
set_load -pin_load 5 [get_ports {sd_CKn}]
set_input_transition -max 0.5 [get_ports {sd_DQ[*]}]
set_load -pin_load 20 [get_ports {sd_DQ[*]}]
set_load -pin_load 20 [get_ports {sd_A[*]}]
set_load -pin_load 20 [get_ports {sd_BWS[*]}]
set_load -pin_load 20 [get_ports {sd_LD}]
set_load -pin_load 20 [get_ports {sd_RW}]
